; domain
(define (domain drone_mission)

  ;; Specify required features
  (:requirements :strips :typing :equality :universal-preconditions)

  ;; Define types
  (:types
    drone area station sensor - object
  )

  ;; Predicates
  (:predicates
    ;; Drone state and position
    (At ?d - drone ?p - area)
    (AtStation ?s - station ?p - area)
    (HasSensor ?d - drone ?s - sensor)

    ;; Area state
    (DataCollected ?a - area ?s - sensor)

    ;; Operational constraints
    (Blocked ?from - area ?to - area) ; Indicates that a path between two areas is blocked
    (Occupied ?p - area) ; Indicates if an area is occupied by a drone
    (Adj ?from - area ?to - area) ; Indicates if two areas are adjacent
  )

  ;; Action: Move
  (:action Move
    :parameters (?d - drone ?from - area ?to - area)
    :precondition (and
      (At ?d ?from)
      (Adj ?from ?to)
      (not (Blocked ?from ?to))
      (not (Occupied ?to))
    )
    :effect (and
      (not (At ?d ?from))
      (At ?d ?to)
      (not (Occupied ?from))
      (Occupied ?to)
    )
  )

  ;; Action: Collect data
  (:action CollectData
    :parameters (?d - drone ?a - area ?s - sensor)
    :precondition (and
      (At ?d ?a)
      (HasSensor ?d ?s)
      (not (DataCollected ?a ?s))
    )
    :effect (and
      (DataCollected ?a ?s)
    )
  )

  ;; Action: Recharge (not needed for now, drones do not consume energy)
)

; problem
(define (problem drone_mission_1)
  (:domain drone_mission)

  ;; Objects in the problem
  (:objects
    drone1 drone2 - drone
    station1 station2 - station
    area1 area2 area3 area4 area5 area6 area7 area8
    area9 area10 area11 area12 area13 area14 area15 area16 - area
    temp hum - sensor
  )

  ;; Initial state
  (:init
    ;; Drone initial positions
    (At drone1 area3)
    (At drone2 area13)

    ;; Initial energy states
    ;;(HasEnergy drone1)
    ;;(HasEnergy drone2)

    ;; Stations
    (AtStation station1 area1)
    (AtStation station2 area16)

    ;; Adjacencies (4x4 grid)
    (Adj area1 area2) (Adj area2 area3) (Adj area3 area4)
    (Adj area5 area6) (Adj area6 area7) (Adj area7 area8)
    (Adj area9 area10) (Adj area10 area11) (Adj area11 area12)
    (Adj area13 area14) (Adj area14 area15) (Adj area15 area16)
    (Adj area1 area5) (Adj area2 area6) (Adj area3 area7) (Adj area4 area8)
    (Adj area5 area9) (Adj area6 area10) (Adj area7 area11) (Adj area8 area12)
    (Adj area9 area13) (Adj area10 area14) (Adj area11 area15) (Adj area12 area16)

    ;; Bidirectional adjacencies
    (Adj area2 area1) (Adj area3 area2) (Adj area4 area3)
    (Adj area6 area5) (Adj area7 area6) (Adj area8 area7)
    (Adj area10 area9) (Adj area11 area10) (Adj area12 area11)
    (Adj area14 area13) (Adj area15 area14) (Adj area16 area15)
    (Adj area5 area1) (Adj area6 area2) (Adj area7 area3) (Adj area8 area4)
    (Adj area9 area5) (Adj area10 area6) (Adj area11 area7) (Adj area12 area8)
    (Adj area13 area9) (Adj area14 area10) (Adj area15 area11) (Adj area16 area12)

    ;; Blocked path between areas
    ;;(Blocked area10 area11)
    ;;(Blocked area11 area10)

    ;; Occupancy
    (Occupied area3)
    (Occupied area13)

    ;; Sensor capabilities
    (HasSensor drone1 temp)
    (HasSensor drone2 hum)
  )

  ;; Goals
  (:goal
  (and
    (DataCollected area1 temp)
    (DataCollected area1 hum)
    (DataCollected area2 temp)
    (DataCollected area2 hum)
  )
)


  ;; Metric to minimize total time (removed due to no numeric support)
  ;;( :metric minimize (TotalTime))
)

; plan
1. (move drone2 area13 area9)
   deleted: (at drone2 area13) (occupied area13)
   added: (at drone2 area9) (occupied area9)
   goals met: 0 of 4
2. (move drone2 area9 area5)
   deleted: (at drone2 area9) (occupied area9)
   added: (at drone2 area5) (occupied area5)
   goals met: 0 of 4
3. (move drone2 area5 area1)
   deleted: (at drone2 area5) (occupied area5)
   added: (at drone2 area1) (occupied area1)
   goals met: 0 of 4
4. (collectdata drone2 area1 hum)
   added: (datacollected area1 hum)
   goals met: 1 of 4
5. (move drone2 area1 area2)
   deleted: (at drone2 area1) (occupied area1)
   added: (at drone2 area2) (occupied area2)
   goals met: 1 of 4
6. (collectdata drone2 area2 hum)
   added: (datacollected area2 hum)
   goals met: 2 of 4
7. (move drone2 area2 area6)
   deleted: (at drone2 area2) (occupied area2)
   added: (at drone2 area6) (occupied area6)
   goals met: 2 of 4
8. (move drone1 area3 area2)
   deleted: (at drone1 area3) (occupied area3)
   added: (at drone1 area2) (occupied area2)
   goals met: 2 of 4
9. (collectdata drone1 area2 temp)
   added: (datacollected area2 temp)
   goals met: 3 of 4
10. (move drone1 area2 area1)
   deleted: (at drone1 area2) (occupied area2)
   added: (at drone1 area1) (occupied area1)
   goals met: 3 of 4
11. (collectdata drone1 area1 temp)
   added: (datacollected area1 temp)
   goals met: 4 of 4
